export const azkar = [
    "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ",
    "اللَّهُمَّ اغْفِرِ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِي",
    "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ العَظيم",
    "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
    "أعوذُ بكلماتِ اللهِ التامَّاتِ مِن شرِّ ما خَلق",
    "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
    "ربِّ إغْفر لى و إرْحَمنى",
    "اللّهُـمَّ انَّك عَفوٌ كَريمٌ تٌحِبُّ العَفْوَ فاعْفوا عَنَّا",
    "اللّهُمَّ قَرِّبنى مِن طَاعَتِك و ابْعِدنى عَنْ مَعَاصِيك",
    "اللَهُمَّ صلِّ وسَلِم وبَارِك على سيدنا محمد (ﷺ)",

]


export function getRandomElement<T>(list: T[]): T {
    if (list?.length === 0) {
      throw new Error("The list is empty.");
    }
    const randomIndex = Math.floor(Math.random() * list.length);
    return list[randomIndex];
  }
    